[
{"body": " <SEP> hi <SEP> ! <SEP> can any one can explain while error is showing at context <SEP> any one there <SEP> make type of Set as Strings <SEP> Set <SEP> ok <SEP> and put \"contextNames\" <SEP> where i need to change the context Names <SEP> in the code <SEP> for(String s: contextNames) <SEP> ! <SEP> ya i have changed but error is showing <SEP> Set <SEP> ya thank you resolved <SEP> Set <SEP> i have doubt i have used your code <SEP> NATIVE_APP WEBVIEW_com.bsb.hike <SEP> i have receive the console output like this what it means <SEP> it is native app right what about second one <SEP> guys <SEP> can any one explain <SEP>  @praveen1211 your app current view has two context native as well as webview <SEP> hybrid app <SEP> ok how can i switch to webview @mgmanikandan87 <SEP> and start finding the elements <SEP> and try to do automation <SEP> of the apk file <SEP> in android keyword action commands how to write <SEP> above code will help u to swtich the context <SEP> Set <SEP> then you can <SEP> automate <SEP> ok its switch but how to check whether it was switch or not <SEP> System.out.println(driver.getContext()); Set <SEP> i have written ur code i have got output in the console like NATIVE_APP WEBVIEW_com.bsb.hike <SEP> just print the conext before swtich <SEP> to get elements where i need to check whether in the chrome by typing url or how",
 "our": "error is showing at context in android keyword action commands\n",
 "gd": "why context name is showing error? \n"}
 , {"body": " <SEP> Hi All <SEP> I have posted a private post and I want to check that  the post is not visible to any one <SEP> Then How can I execute this scenario using Appium <SEP> @ravurirajesh is your test using desired capabilities ? <SEP> yes we are using desired capabilities @extr3mal <SEP> what device do you have in capabilities , and do you have any custom server strings in appium advanced settings ? <SEP> No we don't have any server strings configured and we are using the below cap.setCapability(MobileCapabilityType.PLATFORM_VERSION, \"8.4\"); cap.setCapability(MobileCapabilityType.DEVICE_NAME, \"iPad Air\"); <SEP> Okay what do you have in advanced server settings inside appium ios settings <SEP> none of the check boxes are selected under Advanced tab <SEP> http://joxi.ru/Y2LqnLwtZjdwA6 <SEP> Nope we don't have any custom server flags <SEP> The code that we have works on other mac machine...it just doesn't work on my machine <SEP> Logic hints that you have some difference with another machine's appium server <SEP> Try to compare settings for both of them <SEP> @extr3mal Thank you! will check and let you know.", "our": "how to execute scenario using Appium?\n", "gd": "how to execute this scenario using Appium \n"}, {"body": " <SEP> https://gist.github.com/ <SEP> @aniket-21 https://gist.github.com/anonymous/175eb26f12df27a6b1fa3bb2e0a5a132 <SEP> I have uploaded here <SEP> @shabinmohan , as per my understanding, to run on simulator, you should be providing .app file and not .ipa file <SEP> debug <SEP> how come you have some many devices connected? <SEP> ``` iOS sim UDID is F81E7689-E30C-4934-8D33-260E0B177F3A. I dont think there should be any UDID for SIM  ``` <SEP> I am wrong <SEP> people are saying that UDID of simulator is same as UDID of MAC <SEP> @sjenasears do you got the solution? <SEP> @aniket-21 - just a question do we need to set the profile in debug mode while creating ipa file? <SEP> Which profile <SEP> in Xcode Product - <SEP> No i did not found a  solution.Tryying to use by downgrading appium 1.6.3 <SEP> but getting this error org.openqa.selenium.SessionNotCreatedException: Unable to create new remote session. desired capabilities <SEP> @sjenasears can you post full appium logs <SEP> ? <SEP> https://gist.github.com/sjenasears/5888afc1857614eb77c93b7278110225 <SEP> this is not appium logs <SEP> Ok <SEP> HTTP <SEP> {app=/Users/sjena/Desktop/Relay_Appium/ipa/new_ipa/SYW Relay.ipa, ie.ensureCleanSession=true, appium-version=1.6.3, platformVersion=10.2, browserName=Safari, platformName=iOS, udid=67840d8ffcb8b2e3d4cc26fa1808087cc2994d01, deviceName=iPhone Simulator} <SEP> are you sure above are your cabs <SEP> ? <SEP> *caps <SEP> yes <SEP> your giving udid <SEP> and <SEP> device name <SEP> as iphone simulator <SEP> are you trying to run simulator or device <SEP> ? <SEP> then no need of udid <SEP> and one more thing <SEP> removing udid also  i get same error <SEP> who gave the ipa <SEP> ? <SEP> dev <SEP> ? <SEP> ? <SEP> or you generator <SEP> i generated <SEP> by xcode <SEP> are you generate the ipa , iphone simulator support <SEP> ? <SEP> no need to mention the browser name <SEP> did you able to install <SEP> simluator manually <SEP> from xcode", "our": "error org.openqa.selenium.SessionNot\n", "gd": "ios sim UDID is not the same as MAC UDID\n"}, {"body": " <SEP> Hi , Iam into mac desktop application testing , we are planning to automate testing , Is Appium can automate Mac desktop app. TIA <SEP> @vinovisvam_twitter https://github.com/appium/appium-for-mac <SEP> @Asimk21 Thank you <SEP>  no @mgmanikandan87 I tried with print the ContextHander and got only one \"Native _View\" But my app has the both on the same window, naive and web. Why I'm getting Native only on the window??? Any ideas. <SEP> pressKeycode(66) is not working <SEP> i'm using 1.7.1 <SEP> ok, you can try it once", "our": "is Appium able to automate mac desktop app testing?\n", "gd": "is it possible to use appium for mac desktop application testing?\n"}, {"body": " <SEP> ! <SEP> @sanojqa :  I can view the elements in uiautomatorviewer Are u trying to access the same download button ? <SEP> how can you done this? <SEP> Hi Guys, I tried using calabash and selendroid mode but I dint find any solution with regards to how to get color of an element .It may be text or status .Then validate in script?Can Anyone help regarding this <SEP> @sanojqa : Nothing special. just tried with uiautomatorviewer..", "our": "how to get color of an element in uiautomatorviewer?\n", "gd": "how to access the same download button in uiautomatorviewer?\n"}, {"body": " <SEP> https://bitbucket.org/appium/appium.app/downloads/ <SEP> that osk <SEP> osx and windows: http://blog.wedoqa.com/2015/10/setting-up-appium-on-mac-os-x-for-ios-virtual-devices-to-test-your-application/ <SEP> wish I could figure out 1.5.3 anyone else having the same issues? <SEP> log in appium: http://paste.thezomg.com/19734/68610107/ <SEP> even after Installing appium and giving the right path its throwing error as error: Could not find a device to launch <SEP> alright got a answer on my issue for appium 1.5.3 cant have --pre-launch that was removed in 1.5.3 as well", "our": "cant have --pre-launch that was removed in 1.5.3\n", "gd": "appium 1.5.3 can't have pre-launch that was removed in 1.5.3\n"}, {"body": " <SEP>  <SEP>       /**      * Scroll down using Id (not special listView, only window) - <SEP> Ofc put the scrollDown() logic in function. <SEP> If it's a ListView then scrollDown() the ListView, not the window. <SEP>  I have one .app for different devices.  I find out that  \"Amazon TV\" doesn't provide resourceId  but on other devices such attribute is displayed. May be somebody faced out with such behaviour on Amazon devices. Any idea? <SEP> Following up from my 8/7 question: it seems the issue was that I had an old iOS 9 beta version installed on my device. <SEP> Once I updated to the latest version automation worked. <SEP> Er, UIAApplication... <SEP> has anyone here used multiple drivers in a single session <SEP> im looking for info on handling multiple WebDriverWait instanes <SEP> instances*", "our": "scroll down using Id (not special listView, only window)\n", "gd": "how to handle multiple WebDriverWait instances in a single session\n"}, {"body": " <SEP> hello Simon.... <SEP> please explain scenario.... <SEP> @Simon-Kaz  are you able to locate element with Name....or Lable Property...??? <SEP> Anyone have any idea if/when the Documentation and Tutorial are going to be updated? Entire sections are missing and the screenshots look nothing like the current version of the app <SEP> appium 1.4.0 : Android : \"fix for scrollTo\", does someone know what is the fix? <SEP> would be nice to have github issues linked on release page <SEP> long press gesture failed in appium 1.4.0 <SEP> and worked in 1.3.7 with same java client 2.2.0 <SEP> Hi All, Does anyone know \"how to start and stop the appium server programatically using java?\" <SEP> Does anyone know how to get iOS absolute coordinates based on user touch? I'm trying to automate clicking something on a canvas and unfortunately I need to use hard coded coordinates to do this. In Android i'm able to use an option in Developer Settings called pointer location. I've had no luck finding the iOS equivalent <SEP> if its a native app, you can use appium inspector to locate the coordinates <SEP> Does anyone know \"how to start and stop the appium server programatically using java?\" Does anyone tried this?? <SEP> @Rohithnm Hi. I think you could do it with bash commands: http://stackoverflow.com/questions/26830617/java-running-bash-commands <SEP> Guys, what the best approach to implement logging in to appium(ruby) framework? as I understand - there is no access to appium server logs, and it is unable to put them in to file, with framework specific messages. I'm looking for a way to capture driver level logs(i.e. clicking on elements, waiting etc) and save them to log files.  including logger in to framework methods - looks like not the best approach. <SEP> @brbrr  Hi, I'm using windows OS for Appium <SEP> @Rohithnm ok, anyway, you got the point. run it from os env. <SEP> google is a fancy thing <SEP> this is the first result <SEP> https://discuss.appium.io/t/launching-and-stopping-appium-server-programmtically/700 <SEP> @brbrr  Thanks <SEP> @Simon-Kaz  But it  not working for me :(\\ <SEP>  <SEP> is it possible to retrieve an element with its index and resource-id , like :                                  findByXpath(\"//* <SEP>  findByXpath(\"//* <SEP> that should work <SEP> Thank you, I just realized that I was mixing Xpath and CSS3 selectors .... <SEP> which test cloud works best with appium? <SEP> How can we run test on android version  <SEP> it supports but id used by selendroid and id used by uiautomator are different <SEP> so script will not work, if you just choose capability to selendroid <SEP> Thanks @priyankshah217 : When i take the screenshot in uiautomator it doesnot show me the resource id in 4.2 version, so how can i make the same script work on previous versions of devices? <SEP> you need to use annotations @FindByAll() within that you can provide locators whichever applicable <SEP> i have sample code let me share link to you <SEP> ok..thanks <SEP> https://github.com/appium/sample-code/blob/master/sample-code/examples/java/junit/src/test/java/com/saucelabs/appium/page_object/android/ApiDemosListViewScreenSimple.java <SEP> you can combine multiple locators and try <SEP> ok so basically we are specifying in case you dont find the id, try searching by some other locator etc <SEP> Thanks Priyank <SEP> is it possible to set some click position offset? As I understand, by default click goes right in to element center. <SEP> With java-client you can use tap with offset : http://appium.github.io/java-client/ <SEP> im having trouble with scrolling to an element with child selector attached to it", "our": "how to get iOS absolute coordinates based on user touch in appium framework?\n", "gd": "how to get absolute coordinates based on user touch in appium 1.4.0?\n"}, {"body": " <SEP> I have not sure to call it spinner in the appium simulator it show like this   <SEP> hi team any one work on integration of appium with xamarian <SEP> any one there to reply <SEP> Vignash any site on the internet that lets you paste source code <SEP> @sitansu_kar007_twitter , have tried with locators using ui-automatior, able to find the element an using send keys sending the data. but after sending  value, nothing is happening. keyboard ENTER functionality also not applicable for here.                    WebElement element = driver.findElement(By.id(\"id/job_address\"));             element.sendKeys(\"London,UK\");             TimeSleep();  // static function <SEP> use element = wait.until(ExpectedConditions.presenceOfElementLocated(By.id(\"YOUR_ID\")));", "our": "how to call it spinner in the appium simulator it show like this\n", "gd": "how to use spinner in appium with xamarian\n"}, {"body": " <SEP> Hi Any body with iOSPredicate knowledge here.....? If so please help in getting the iOSPredicate for the below XPath <SEP> //UIAApplication <SEP> besides I have few other XPaths which I will share once I receive for this <SEP> Hi Friends, Can anyone tell me. How do i handle dates in below mentioned datepicker <SEP> ! <SEP> using selenium web driver.", "our": "how do i handle dates in below mentioned datepicker?\n", "gd": "how to get iOSPredicate for UIAApplication\n"}, {"body": " <SEP> Hi <SEP> i have one quention <SEP> is possible with appium, automate non owner application, i mean, i do some clicks in viber to meassure traffic <SEP> u can for Android not for iOS", "our": "is it possible to automate non owner application with appium?\n", "gd": "is it possible to automate non owner application in appium?\n"}, {"body": " <SEP> Hi <SEP> yes <SEP> I have installed appium in ubuntu 18  and i am getting this <SEP> Are you also facing issue with Ubuntu? <SEP> correct ! <SEP> I have almost search every link in Google <SEP> for this installation <SEP> but still working on it ! :smile: <SEP> appium -a 127.0.0.1 -p 4723  <SEP> yes <SEP> now what i have to do ?? <SEP> I have asked appium community -  https://discuss.appium.io/t/how-to-install-appium-on-ubuntu-linux-17-10/21882 <SEP> lets hope if anyone can reply us on this? <SEP> Thank you <SEP> ! <SEP> Hi Guys, I have installed sdk on windows 10 with 64 bit but I can see that UIAutomator Viewer is not working.I am getting error message when run from cmd .Can anyone help on this ? I have installed only Android 5.0.1 & 5.1.1 Android versions .Is it dependent on this ? <SEP> Hi Good Morning... Appium inspector is too slow am using the 1.7.2 appium. can anyone help me out to get the solution for this ? <SEP> Hi, im using Appium + web driver.io, there is way to change settings on iOS device? change vpn profile e.g. <SEP> and how can I clear safari cache? <SEP> How to do setup of appium  with python, <SEP> link or video , please suggest <SEP> what do you mean how to do setup with python? <SEP> you should isntall the appium-python library <SEP> pip install Appium-Python-Client for the library <SEP> @Asimk21 can I somehow redirect traffic from Appium or it is always should be done manually? <SEP> @Asimk21  Hi  Appium inspector is too slow am using the 1.7.2 appium. can anyone help me out to get the solution for this ? <SEP> @xu_budll_twitter Sorry, I didn't get that. Can you explain bit more? or PM me <SEP> @friendlyspeak_twitter Try to upgrade or downgrade appium. Hope that resolves you issue. <SEP> thanks  @Asimk21 <SEP> Hi All, I am facing issues with my method \"clearTextInputnewValue\" . When this method is executing its selecting the value from input box to clrear the text but not able to paste new value. I am using selenium 3.10.0, Firefox vs 58.0.1 and gecko driver-v0.19.1 Below is the pseudocode for this method  public void clearTextInputnewValue(String TestDesc,String objectref, String inputparam,String objectType,boolean bResult,TreeMap m) throws Throwable   {    try{            Thread.sleep(500);     System.out.println(\"Into clearTextInputnewValue() :: Driver Is:\"+driver);     System.out.println(\"Into clearTextInputnewValue() :: Object Reference Is:\"+objectref);     System.out.println(\"Into clearTextInputnewValue() :: Input Parameter Is:\"+inputparam);     System.out.println(\"Into clearTextInputnewValue() :: ObjectType Is:\"+objectType);           Log.info(\"Clearing text and Input New value:   \"+ objectref);          System.out.println(\"...................Clearing Text Event Started........\");          driver.findElement(By.xpath(objectref)).sendKeys(Keys.chord(Keys.CONTROL, \"a\"),inputparam);          System.out.println(\"...............Clearing Text and Inputing new Value Event Completed........\");          //driver.findElement(By.xpath(objectref)).sendKeys(Keys.HOME,Keys.chord(Keys.SHIFT,Keys.END),inputparam);             Thread.sleep(3000);        captureScreenShot(driver);        reporter.onSuccessscreenshot(TestDesc, \"is successful\", afileLocdir+\"\\\\\"+aTestStepID+\".png\",m);     Thread.sleep(100);        }catch(Exception e){      Log.error(\"Not able to clear text --- \" + e.getMessage());        e.printStackTrace();        DriverScript.bResult = false;      Thread.sleep(2000);      captureScreenShot(driver);      reporter.onFailure(TestDesc, \"is Failed\", afileLocdir+\"\\\\\"+aTestStepID+\".png\",m);/  Can anyone help me out to solve this issue? <SEP> Hi all,  I'm unable to formatting the below xpath on android platform to find:  String filterValueXPath= \"//android.widget.TextView", "our": "how to install appium on ubuntu 18?\n", "gd": "UIAutomator Viewer not working on ubuntu 18\n"}, {"body": " <SEP> Thanks  @hazmeister <SEP> I'm trying to run a safari test on a real iOS device - works in the simulator and on android device but I can't get the apple phone running on appium 1.6.3 <SEP> it was working previously on appium 1.6.0 with iOS 9 <SEP> updated phone to 10.2.1 and appium to 1.6.3 <SEP> getting this: <SEP> ` <SEP> not sure where undefined command is creeping in from <SEP> seems to be failing on the first driver.get() <SEP> ok, turns out part of the problem was lcokdown was inaccessible <SEP> sudo chmod 777 /var/db/lockdown", "our": "safari test on real iOS device but can't get apple phone running on appium 1.\n", "gd": "unable to run safari test on apple phone ( appium 1.6.3 )\n"}, {"body": " <SEP> I am getting the following error repeatedli <SEP> \"org.openqa.selenium.WebDriverException: org.apache.http.conn.HttpHostConnectException: Connect to 0.0.0.0:4723  <SEP> This error repeats every 3 to 4 weeks, and corrects itself automatically. Otherwise I am running test scripts successfully. <SEP> Can anyone provide some insight into this issue?", "our": "org.openqa.selenium.WebDriverException:\n", "gd": "getting error \"org.openqa.selenium.WebDriverException:Connect to 0.0.0.0:4723 \"\n"}, {"body": " <SEP> hello <SEP> can anyone help me with the maven dependency for appium <SEP> thanks <SEP> @mgmanikandan87 <SEP> I am using ironic, nativ script and corodova <SEP> When I tried, all element is not displayed hence unable to locate using the locators <SEP> Hi, after upgrading to Appium 1.11.0 I am getting a error on driver creation \" <SEP>   When I am entering a text in text box it will provide auto complete test suggestion need to click on the suggestion but it is not giving the suggestion <SEP> Manually its listing <SEP> Yes <SEP> I mean suggestion box <SEP> Ok <SEP> Can u enter text and put thread sleep <SEP> Yes suggestion box is showing on manual <SEP> 4 sec <SEP> Tried but didn't help <SEP> Thats odd <SEP> Can u share screenshot <SEP> Here how? <SEP> Take link or screenshot <SEP> Link of screenshot <SEP> I do i get  android device height using wdio/js? <SEP> Hi All,  I am working on a POC where we are trying to generate scripts automatically when the user performs action on Mobile devices (Web & Native app on Android & iOS) by connecting it to the system.  We did a similar solution for Desktop web application using JavaFx which captures the actions  <SEP> @iceKirthi as per my knowledge we dont have any specific API for this.", "our": "maven dependency for appium is not showing on manual\n", "gd": "appium maven dependency - error on driver creation after upgrading to 1.11.0\n"}, {"body": " <SEP> ! <SEP> Are you want to start two session in desktop ? <SEP> am i correct ? <SEP> one for ios and one for andorid <SEP> i think current setup you can start only one session and other start new session for inpsector <SEP> i am not sure you can start two session <SEP> in desktop <SEP> appium", "our": "how to start two sessions in desktop?\n", "gd": "is it possible to start two sessions in desktop?\n"}, {"body": " <SEP> ? <SEP> if you are not admin I am using  @Fubarp could be as lot of npm installations do need to be <SEP> chmod <SEP> if you find the fodler <SEP> right click the folder and go to getinfo <SEP> there <SEP> you can find below <SEP> alright <SEP> permission <SEP> followed the path <SEP> click the lock simple right bottom corner <SEP> and change the permission <SEP> everyone <SEP> to read and write <SEP> thats it <SEP> got it ? <SEP> yes.. maybe <SEP> we shall see <SEP> ok <SEP> oh cool it worked <SEP> excellent. Now back to your tutorial video lol <SEP> :) <SEP> enjoy", "our": "chmod is used to change permissions for npm installations\n", "gd": "lot of npm installations do need to be admin\n"}, {"body": " <SEP> can anyone tell me if it is possible to use Appium to automate emails within mobile email clients? Our startup makes interactive emails that require extensive manual testing, looking for solutions to automate the email interactions locally (toggling dropdowns, swiping carousels, etc) <SEP> I know bitbar has an example for the app store, so I think you should be able to achieve this in iOS not sure about android. Here's a link perhaps it might give you an idea? http://bitbar.com/how-to-access-app-store-from-appium-script/ <SEP> @Edge-Man thanks for the link but isn't opening an email client and clicking inside an email completely different from clicking around the app store?", "our": "is it possible to use Appium to automate emails within mobile email clients?\n", "gd": "is it possible to use Appium to automate emails within mobile email clients?\n"}, {"body": " <SEP> it doesn't work for system alerts <SEP> like the one for google play services on android <SEP> i was able to use the alert api for iOS for custom alerts on devices <SEP> does anyone know if its possible to do regex like pattern matching with xpath? <SEP> i'm searching for a label that contains only digits, but the documentation out there is slim to none <SEP> this is for iOS <SEP> Is there some way to clear the cache/cookies/history programmatically? <SEP> try adding `fullReset = true` to the ` <SEP> resets the simulator", "our": "is it possible to do regex like pattern matching with xpath?\n", "gd": "is it possible to do regex like pattern matching with alert api for iOS?\n"}, {"body": " <SEP> anyway, i need to find a free alternative to genymotion. sure, for personal use is free but i'm researching that to use it in my company then i need to find some way to run web tests on android without increase QA costs. <SEP> does anybody have some tutorial about how to run a test on default browser using appium? <SEP> using SDK emulator i mean", "our": "how to run web tests on default browser using appium?\n", "gd": "how to run web tests on android on default browser using appium?\n"}, {"body": " <SEP> https://github.com/saikrishna321/AppiumAndroidParallelExecution <SEP> need some info on grid not relate to appium , <SEP> just wanted to check if test distribution can happen over multiple android devices when running tests through appium", "our": "if test distribution can happen over multiple android devices when running tests through appium\n", "gd": "is it possible to run tests over multiple android devices in parallel with appium?\n"}, {"body": " <SEP> Hi guys <SEP> I want to reset the app to original state every time a new scenario is run in android mobile automation with appium <SEP> I am using spring bean implementation so it will create only one session <SEP> within the session, is it possible to close the app and launch again (or) reset the app <SEP> I tried using 'resetApp()' but when any scenario fails, it does not pick the next scenario <SEP> the remaining scenarios also fails <SEP> please if anyone is using resetApp , help me <SEP> I am using Java and cucumber with Junit <SEP> @archanarathnam  have you tried \"noReset:false\" capability? <SEP> yes <SEP> that will leave the app in the same state for next scenario <SEP> i did not get this \"I tried using 'resetApp()' but when any scenario fails, it does not pick the next scenario the remaining scenarios also fails\" <SEP> can you explain? <SEP> resetApp() works fine <SEP> the problem is - when there is no failure in test, it is perfect <SEP> when any scenario fails, the remaining scenarios also fail in the first step itself <SEP> it just launches the app and fails <SEP> @kumarswamy757  are you also using resetApp() method <SEP> yes i'm also using it. I don't have any issues with it. what is the java_client version you are using? <SEP> and appium version also <SEP> appium 1.7.2 <SEP> java_client version? <SEP> 5.0.4 <SEP> try using this java_client version \"6.0.0-BETA4\" <SEP> when you find any scenario failed, is it resetting the app again <SEP> and able to proceed further? <SEP> ya I will try this version. Thanks <SEP> Hi guys any did u used Appium with robot framework for client testing? I have an issue to input text in child elements <SEP> @SamyQAZ  tell me the problem you are facing <SEP> Hi @Kumar, I am using robot framework, python with Appium  currently I am facing issue to input text in reusable child elements with robot framework for iOS  Eg: Parent1 - textboxA                            textboxB  Parent2 -  textboxA                      textboxB  I want to enter text in textboxA & B of Parent2.   There is no way I can see in robot framework keywords using which I can perform this action.  Is there a way to do it using robot frame work? Can this be done using python and call the script in robot framework? <SEP> @kumarswamy757 I am still facing the same issue <SEP> can you please help me out <SEP> @SamyQAZ  will check and update you. <SEP> @archanarathnam can you pls send samplecode that how you are designing the scenarios? <SEP> @archanarathnam  You may use closeaap() when u don't want the app to fresh install. <SEP> @archanarathnam may be that is not an issue with the appium rather it is an issue with your design. <SEP> @SamyQAZ since I am using only one session, it closes app and does not open app next time <SEP> @archanarathnam In case if the test fails you may ignore error and run test further, this is how I do it using robot framework currently <SEP> but it is not able to run test further <SEP> it fails <SEP> first step after resetApp <SEP> is it possible to share ur script? @archanarathnam <SEP> which part of script <SEP> @SamyQAZ you can use this to call the python script using robot framework https://stackoverflow.com/questions/44311287/call-python-from-robot-framework <SEP> @Passsword Nope not used before. Is it really helpful compared to local testing. It requires sharing ur application to the cloud right?", "our": "how to reset the app to original state every time a new scenario is run in android\n", "gd": "how to reset the app every time a new scenario is run in android mobile automation with app\n"}, {"body": " <SEP>  <SEP> ? <SEP> @Rohithnm  RAM-16 GB, 500 GB HDD, OS- Ubuntu 16.04 , Intel i3 processor <SEP> @DIVYASHIKHA_twitter http://appium.io/slate/en/master/?java#running-appium-on-linux <SEP> @Rohithnm I have one more silly doubt <SEP> do I have to install eclipse and android sdk for appium.. As I already have android studio.. <SEP> no not required... <SEP> yep <SEP> its just an IDE <SEP> @DIVYASHIKHA_twitter http://ubuntubegin.blogspot.de/2015/07/how-to-setup-appium-in-ubuntu.html <SEP> I already tried all these commands on my PC. Getting error while installing appium <SEP> @Rohithnm <SEP> @DIVYASHIKHA_twitter the OS version which you are using is the latest. i guess appium doesn't support this version <SEP> of Ubuntu", "our": "Getting error while installing appium on linux\n", "gd": "appium doesn't support the latest OS version\n"}, {"body": " <SEP> Someone when we launch tests, at the beginning of one of them (randomly) we have a kill all instrument (iOS), did someone experience this issue? iOS 8.3/last appium version. <SEP>                   info:  <SEP> By the way, wanted to say Sometimes*, not someone ... <SEP> I see that sort of thing (instruments crashing on startup) and it often takes several retries for Appium to load-up our apps (simulator).  Strange... <SEP> The problem here is that the appium session is killed after this retry fails, it breaks all the following tests so. It's rather violent. We didn't have this behavior before. <SEP> It might come from new Xcode. <SEP> Yes...have to retry the <SEP> installation multiple times before starting the actual test. <SEP> is it possible to access the 'path' attribute that is shown in driver.page_source? <SEP> So basically something like getDriver().get(\"myUrl\") which detects the new activity opened.", "our": "kill all instrument when launch tests\n", "gd": "is it possible to access the 'path'attribute in driver.page_source?\n"}, {"body": " <SEP> I have one doubt in my test case.it is how can i click and hold then pull down the elementt <SEP> if you have solution send a mail with solution <SEP> kommuswamy7786@gmail.com <SEP> Check this out: https://discuss.appium.io/t/drag-drop-hello-world-example/499 <SEP> Can someone explain when to use return driver and when not to use return driver? I seem to get stuck when I should and should not be using the return part. <SEP> Using Mocha and JS <SEP> NetworkConnectionSetting in Java Client only for Android?   I need to enable and disable WiFi or data in iPhone using appium. Is it possible?  When went through some blogs it saying this capability only supported for Android.  Anyone have the idea about this? <SEP> yes. its only for android <SEP> @PavithraRavichandran Do you need to enable the network connection or check the status of network? I have done for Android only using adb. Other option is with help of  AndroidDriver (please refer: http://appium.readthedocs.org/en/stable/en/writing-running-appium/network_connection/) <SEP> I need the both, @sanojqa <SEP> Thank you, I'll refer to the link and get back to you <SEP> If I have any questions", "our": "how to click and hold then pull down the elementt in test case\n", "gd": "how can i click and hold then pull down the element in appium ios\n"}, {"body": " <SEP> ?? <SEP> Is WDA installed on device? <SEP> its not installation problem. its an connection timeout issue while execution of test scripts <SEP> Yeah, just uninstall WDA and try it again. <SEP> sometimes stale WDA connection might cause it to timeout <SEP> but this issue is appearing in between execution <SEP> Can you try running WDA on different port? <SEP> `--webdriveragent-port` <SEP> okay i'll try that", "our": "is WDA installed on device?\n", "gd": "is WDA installed on device? \n"}, {"body": " <SEP> Hello, Appium community! Could you ask me how can I attach to created early session in code (from python, for example)? Which api should I use? <SEP> Like Appium Inspector it does <SEP> I have appium installed globally on a Jenkins node, however when I try to run the test through Jenkins on said node I get  ``` { Error: connect ECONNREFUSED 127.0.0.1:4723     at Object._errnoException (util.js:992:11)     at _exceptionWithHostPort (util.js:1014:20)     at TCPConnectWrap.afterConnect  <SEP> I've had this problem sometimes on my local machine and the start the test again and it will start appium. <SEP> which desired should I use 'not to launch the app' . because in my testing scenario. App is already launch. have to continue with it <SEP> desired capability* <SEP> @sumitbera I am trying to automate ios mobile app  using appium with java! a beginner in mobile automation. I set all capabilities and try installing and launching the app.. now i want to scroll down a bit to make the element visible in the mobile simulator and click the element .  I am using java-client 6.1 and facing an error \"Exception in thread \"main\" java.lang.ClassCastException: io.appium.java_client.ios.IOSDriver cannot be cast to org.openqa.selenium.interactions.HasTouchScreen\" Pls some one can help me . Your small is greatly appreciated.  TouchActions action = new TouchActions(driver);         TouchActions dragAndDrop = action.scroll(driver.findElementByName(\"Steven's Mobile QA\"), 0, 744);         dragAndDrop.perform(); <SEP> ======================================================================  I have a question.   <SEP> @kamaleshrnp Hi Kamaleshrnp, remove  <SEP> AndroidDriver <SEP> I am getting the above error. any help on that <SEP> actually screenshot is taken. but the UIdumo.xml is not created <SEP> I am using appium desktop to check whether I can interact with app elements <SEP> AndroidDriver <SEP> I would run my desktop web browser tests with the Webdriver.io Servicive Plugin for appium on real android devices. But I get the follow error:  ``` events.js:160       throw er; // Unhandled 'error' event       ^  Error: spawn C:\\QA\\qa\\node_modules\\.bin\\appium ENOENT     at exports._errnoException (util.js:1022:11)     at Process.ChildProcess._handle.onexit (internal/child_process.js:193:32)     at onErrorNT (internal/child_process.js:359:16)     at _combinedTickCallback (internal/process/next_tick.js:74:11)     at process._tickDomainCallback (internal/process/next_tick.js:122:9)     at Module.runMain (module.js:606:11)     at run (bootstrap_node.js:394:7)     at startup (bootstrap_node.js:149:9)     at bootstrap_node.js:509:3  npm ERR! Windows_NT 10.0.17134 npm ERR! argv \"C:\\\\Program Files\\\\nodejs\\\\node.exe\" \"C:\\\\Program Files\\\\nodejs\\\\node_modules\\\\npm\\\\bin\\\\npm-cli.js\" \"run\" \"end-to-end-appium\" npm ERR! node v6.10.0 npm ERR! npm  v3.10.10 npm ERR! code ELIFECYCLE npm ERR! qa@0.2.0 end-to-end-appium: `wdio wdio.conf.appium.js` npm ERR! Exit status 1 ```", "our": "how to attach to created early session in code (from python, for\n", "gd": "how can i attach to created early session in code from python\n"}, {"body": " <SEP> So automation on iOS simulator has been working fine, I did a reset content on the simulator and it has not worked sense. any thoughts here is the error log... <SEP>  info:  <SEP> ah finally all I had to do was make it do a full reset, I set settings set to no reset... <SEP> @netbrain : sorry you are right (because i'm doing automation with appium and protractor) <SEP> Need a like button here...", "our": "automation on iOS simulator has been working fine, but a full reset content on the simulator\n", "gd": "reset content on the simulator but fails to work\n"}, {"body": " <SEP> Hi <SEP> In the introduciton of appium ... \" Hybrid apps have a wrapper around a \"webview\" -- a native control that enables interaction with web content. Projects like Phonegap, make it easy to build apps using web technologies that are then bundled into a native wrapper, creating a hybrid app.\" <SEP> I would like to try a sample application to test a hybrid app <SEP> Can anyone help? <SEP> ios or android? <SEP> with android its simple, you can use any app you have installed on your phone <SEP> That's the thing ... I have a to try on IPad. <SEP> A physical device that is connected to my PC .... not MAC. <SEP> Is this even possible? <SEP> no, ios device will only work on osx machine <SEP> I see.... Ok then ... So if its a Hybrid app. . <SEP> Is there any samples I could look at? I'm reading on getting started with appium web site and can not find much on hybrid <SEP> phonegap <SEP> hm <SEP> Cause Ill try to test my app on android. just for fun :) <SEP> yeah android is dead simple <SEP> ok kool I have downloaded appium .exe <SEP> i use https://play.google.com/store/apps/details?id=jp.susatthi.ManifestViewer&hl=en to get the package <SEP> package and main activity <SEP> as for phonegap <SEP> http://phonegap.com/app/android/ <SEP> just grab an app from there <SEP> i'd get an actual app rather than a game though <SEP> Hmmm there something I don't understand . <SEP> How can I having my Android connected use Appium app connected to the device. <SEP> Can I only run simulators? <SEP> adb devices .... I can see my device id <SEP> when I open appium application,  I see this  <SEP> But this is my browser...  and it returns That URL did not map to a valid JSONWP resource <SEP> How can I connect my device to appium? This is what Im struggling. <SEP> Has anyone had issues with `arc` failing to parse an `appium.txt` file? <SEP> I continue to get failings immediately when the file begins to be read, failing out at the ` <SEP> \"`- Don't know what to do with \" <SEP> make sure you have simple quotes <SEP> and not formatted by OSX/windows <SEP> but there is not text available thats why i have been trying to use ID or classname", "our": "how to test a hybrid app on ios or android?\n", "gd": "is there a way to test a hybrid app on ios?\n"}, {"body": " <SEP> hybrid app? <SEP> What're you trying to do, find what the elements on the page are? <SEP> ahh, strange <SEP> try upgrading to 1.7.1, that got released yesterday <SEP> may fix the issue", "our": "what are the elements on the page are?\n", "gd": "what are the elements on the page? \n"}, {"body": " <SEP> Anyone know why all my automation would break when updating form 1.4.13 to 1.5.2? <SEP> waitForElementByName(\"ActionsLogOut_Button.\",40000) <SEP> @blueice349 name locator is deprecated since Appium 1.5, its obvious if you read to error log and release notes. <SEP> I didn't see that in the release notes! <SEP> @JaniJegoroff  So what was it replaced with? are they forcing you to use xPath? <SEP> Well alerts I was using elementByName and it found the alert by that name sense you cant sent an ID to alertDialogs <SEP> I have set accessibility ID in everywhere else in my code that I could", "our": "why all my automation would break when updating form 1.4.13 to 1.5.2?\n", "gd": "why does waitForElementByName break form 1.4.13 to 1.5.2\n"}, {"body": " <SEP> Hi ,In my app there is one scenario Photo pinch out/pinch in and tried with touch action but its not working <SEP> plz help me on this <SEP> i am using java-client-4.1.2.jar and Appium v1.6.5 <SEP> and https://github.com/appium/appium/issues/6762#issuecomment-290787395 <SEP> haven't tried pinch myself but these 2 links would give some reference <SEP> Thanks Hardik.I will try and let u know <SEP> where are the android  settings on the desktop app? <SEP> like so I can give the path to my virtual device", "our": "pinch out/pinch in in my app and tried with touch action but its not working\n", "gd": "touching action and pinching out/pinch in are not working in my app using java-client-4.1.2.jar and Appium v1.6.5\n"}, {"body": " <SEP>  <SEP> im not sure what you mean :o <SEP> whats the best way to find a generic scrollable element in android? I'm trying something like this, but its not working  new UiScrollable(new UiSelector().className(\"android.widget.ListView\")); <SEP> MobileElement.sendKeys(\"0620344579\")  - <SEP> weird <SEP> Hi! I've started using appium to test an hybrid app (with cordova) on an real android device. I was able to run the appium server (`node .` in the cloned appium/appium repo), and to run an appium ruby console on my device with arc. I want to switch context to use the WEBVIEW_1 context following  <SEP> what language are you using ? <SEP> I'm using ruby, and I got ```driver.contexts NoMethodError: undefined method `contexts' for # <SEP> try printing out the elements from this  @driver.contexts <SEP> actually, as I'm in `arc`, `@driver` is `driver` ``` # <SEP> what does driver.contexts give you? <SEP> see ^^ (`driver.contexts NoMethodError: undefined method 'contexts' for # <SEP> youre using remote webdriver <SEP> try with appium lib <SEP> how do I get a list of all the views in an activity??", "our": "what is the best way to find a generic scrollable element in android?\n", "gd": "what is the best way to find a generic scrollable element in android?\n"}, {"body": " <SEP> @sachin2788  This link might help <SEP> @sachin2788   http://www.testingdiaries.com/appium-ios-setup-native-apps/ <SEP> https://watirmelon.com/2013/11/05/using-appium-in-ruby-for-ios-automated-functional-testing/ <SEP>  @bibekSahoo  want to run native app and use for selenium webdriver java <SEP> follow the first link <SEP> Ya i read before but ca't help :worried:", "our": "how to run native app and use for selenium webdriver java in rub\n", "gd": "how to run native app for selenium webdriver java in ios\n"}, {"body": " <SEP> give me 2 min. <SEP> @LyubomirStoimchev  : So if I think I understand you want to use Appium to confirm the calendar is in french? What is it currently doing now? The only way I see to test for a locale is by setting is via desired capabilities with \"Locale\" <SEP> There's also Language as well that can be set using : language (Sim/Emu-only) Language to set for the simulator / emulator. On Android, available only on API levels 22 and below <SEP> Let's go a little bit back. I'm currently implementing a way to select a date from android build in calendar (the new one that is material design and not the one with wheels). So far so good. The emulator that I'm running the test in has English as system language but the app itself uses French(or some other non-english language). When you open the calendar while in the app, the system calendar that is opened takes the language from the app and not from the system meaning that the calendar is in French. The problem is that when the calendar is in French all the month values are in french (like \"28 aout 2000\" instead of \"28 august 2000\") and I cannot cast them to DateTime object without knowing the Locale. Yes I know I can hardcode the Locale and cast it with that value but I want to make a more general solution in which I detect the locale of the app and use it when casting the objects. <SEP> Also I have tried using the capabilities that you mentioned but the change the system language and not the app language. <SEP> @LyubomirStoimchev : Got it. Sounds like you need to get the current date locally from the device in english and then based on that search for language that should show. <SEP> you have to know the locale first, if you can't get the locale then that's a problem it sounds with the app <SEP> yep.. <SEP> Well I can select day and year without a problem, but for month I need to know the locale. Currently I'm thinking that since the calendar opens on todays date I can easily navigate and select the date that I need. But the problem is that this is an assumption and somewhere it may not open on todays date. <SEP> yep, that is the risk <SEP> ```  <SEP> As it says, install with *brew* <SEP> or it should be in path `'/usr/local/bin:/usr/bin:/bin:/usr/sbin:/sbin:/node_modules/.bin:/Applications/Appium.app/Contents/MacOS:/Users/.../Library/Android/sdk/tools:/Users/.../Library/Android/sdk/platform-tools:/Users/.../Library/Android/sdk/tools:/Users/.../Library/Android/sdk/platform-tools'` <SEP> @Asimk21 but it's already installed, locally and glabally <SEP> can you do `which carthage` ? <SEP> what is the output <SEP> ```  $npm root carhage -g /usr/local/lib/node_modules ``` so I also added this path to $PATH, and restarted Appium <SEP> It is not in path where appium looks in <SEP> `which carthage` returns nothing <SEP> so its not in path where appium looks in <SEP> how should I fixed the path <SEP> either install with brew or place carthage executable in /usr/local/bin or /usr/bin <SEP> even though I added its path to $PATH? <SEP> easiest way is `brew install carthage` <SEP> okay, will try that. thanks <SEP> After `brew install carthage`: ``` $ which carthage /usr/local/bin/carthage ``` then it works. <SEP> @Asimk21 Thank you! <SEP> and provide a little bit more code / info", "our": "how to confirm the calendar is in french using Appium?\n", "gd": "is there a way to test for a locale on android?\n"}, {"body": " <SEP> Hello, guys <SEP> Does anyone faced any issues running Appium with iOS 13.3 <SEP> I am getting this error <SEP> Error Domain=XCTDaemonErrorDomain Code=11 \"No AXElement found at {160 284}: <SEP> I checked with Appium and they are saying it is an Apple issue <SEP> I did not see this error in 13.2.3 <SEP> Hello All ,  i can't run Appium desktop app  \"The application Appium.app cant be opened.\" on MAc OS Catalina 10.15.1 <SEP> Hi team. we are facing the issue \"could not establish connection to license server appium studio\" while connecting with our office network. Please let us know the license server host name and port details which need to be allowed from our firewall end <SEP>  im getting a 'command not supported error' when attempting to use browser.getWindowHandles() on android device via Browserstack (appium version 1.15), im in the \"CHROMIUM\" context when attempting to retrieve window handles works fine locally, just not browserstack browser.getWindowHandle() seems to work just fine on browserstack any tips on debugging? <SEP> Hi @aizaztoppa, for which android device are you running the test and is it a post request? <SEP> @rahul-bs using Galaxy S9 (os version 9) via browserstack <SEP> the request url is  https://hub-cloud.browserstack.com:443/wd/hub/session/807710f243faa4d8e1184874a20fc037142ca8c1/window/handles <SEP> its just a GET request <SEP> which fails when attempting on browserstack <SEP> works fine locally <SEP> @rahul-bs also, here's the webdriverio logs: <SEP> `2019-12-27T19:42:24.299Z INFO webdriver: COMMAND getWindowHandles()  <SEP> even though the same requests work fine locallu <SEP> @Kajol994  please try https://www.smashingmagazine.com/2016/04/from-zero-to-appium-guide-configuring-appium-android/ <SEP> Is the Inspector significantly \"snappier\"/better in terms of gui lag, etc on better hardware (windows) or is it mainly tied to handset specs?", "our": "error domain=XCTDaemonErrorDomain Code=11\n", "gd": "get error \"no AXElement found at 160 284\" when running Appium with iOS 13.3\n"}, {"body": " <SEP> hi guys <SEP> driver.launch resets the App in Appium <SEP> full reset vs no reset vs resetapp  differnce? can any help me <SEP> Can anyone suggest me how to use below scenarios in Testng annotation with cucumber  Install the app  Runs the scenarios   If scenarios fails reset the app  If scenarios passes  Then also reset the app  Then start executing next scenarios   WRT to BDD framework with java <SEP> On JS, I'm using webdriverIO v4, IOS simulator v12.2, appium (v1.13.0) and try to set the Geo location by webdriverIO as the command below: `browser.setGeoLocation({latitude: \"11.56\", longitude: \"139.099788\", altitude: \"94.23\"});` It throw the error: `Error: An unknown server-side error occurred while processing the command. Original error: Could not complete operation. Make sure Simulator UI is running and the parent Appium application (e. g. Appium.app or Terminal.app) is present in System Preferences ", "our": "how to use below scenarios in Testng annotation with cucumber?\n", "gd": "what is the difference between full reset and no reset in appium?\n"}, {"body": " <SEP> Hi Any body with iOSPredicate knowledge here.....? If so please help in getting the iOSPredicate for the below XPath <SEP> //UIAApplication <SEP> besides I have few other XPaths which I will share once I receive for this <SEP> Hi Friends, Can anyone tell me. How do i handle dates in below mentioned datepicker <SEP> ! <SEP> using selenium web driver.", "our": "how do i handle dates in below mentioned datepicker?\n", "gd": "how to handle dates in datepicker using selenium web driver with ios?\n"}, {"body": " <SEP> Hi..Encountered internal error running command: Error: Sdk '9.3.5' was not in list of simctl sdks     at getDevices$...  what does this error mean.. ?do I have to install sdk ? <SEP> Yes <SEP> install all sdk's for IOS.. should it not come along with Xcode download <SEP> ? <SEP> It depends <SEP> I have xcode 8.3 already.. how or where do I downloads sdks ? <SEP> well.. only with the case of simulators I had there was no version list.. I copied the one from the physical devices folder .. and it worked <SEP> XCode 8.3 only includes iOS 10.3 sdk <SEP> HIii any of you know why appium throws below error sometimes which was working fine earlier <SEP> org.openqa.selenium.WebDriverException: An unknown server-side error occurred while processing the command. Original error: Abnormal Instruments termination! (WARNING: The server did not provide any stacktrace information) Command duration or timeout: 3.57 seconds Build info: version: '3.0.0', revision: '350cf60', time: '2016-10-13 10:48:57 -0700' System info: host: 'PTBLRMAC-SHABIN', ip: '172.18.100.178', os.name: 'Mac OS X', os.arch: 'x86_64', os.version: '10.10.5', java.version: '1.8.0_121' Driver info: io.appium.java_client.ios.IOSDriver Capabilities  <SEP> @aniket-21 .. ok my developer has has setup the keychain in my laptop and also have added development team config in the web driver agent folder.. but I'm still getting Xcode failed cox web driver agent could not be starte <SEP> Did you follow the exact steps mentioned  <SEP> to be exact ,  <SEP> The file WebDriverAgentRunner-Runner.app couldnt be opened because there is no such file.\" UserInfo={NSFilePath=/Users/subarajaram/Library/Developer/Xcode/DerivedData/WebDriverAgent-dikkwtrisltbeobjmfvpthwwekvs/Build/Products/Debug-iphoneos/WebDriverAgentRunner-Runner.app, <SEP> all my runners are under the product folder <SEP> @aniket-21 .. when I tried to check if web driver agent was built correctly.. <SEP> WebDriverAgentRunner\" isn't code signed but requires entitlements. It is not possible to add entitlements to a binary without signing it. Code signing is required for product type 'UI Testing Bundle' in SDK 'iOS 10.3' \"WebDriverAgentRunner\" isn't code signed but requires entitlements. It is not possible to add entitlements to a binary without signing it. <SEP> How to stop scrolling in a page for android ? <SEP> @SubaRajaram09 , is that the error message? <SEP> @aniket-21 i have a question.. i want to fetch certain value from shared preference of my app from apk.. before installing it to device? the purpose of doing so is i need to put condition on them.. like if u get this then run this flow, otherwise do other one.. <SEP> u can suggest any better way also <SEP> can you give an example? <SEP> If I am not wrong, Shared preference is used at runtime as key/value pair to read/write data, is that right? <SEP> yes u r right <SEP> so going back to your que, How can you fetch something before you deploy and run the app? <SEP> Because it is something which is created as part of your app data <SEP> on device <SEP> yes.. i want to my automation to be triggered based on some value in apk.. like if this value is set as a part of do this flow.. i can not do once apk is installed because all devices are un rooted <SEP> anyway.. will search alternate appraoch ..like generate two apk and run automation <SEP> where is the value stored in APK? <SEP> I am not sure if you can have shared pref as part of apk", "our": "error: Sdk '9.3.5' was not in list of simc\n", "gd": "error:sdk 9.3.5 not in list of simctl sdks at getDevices$...\n"}, {"body": " <SEP> @Asimk21 How can I do this? <SEP>  New AndroidUiautomator2Driver session created successfully, session bd6f20b9-2d59-469b-8162-38e5cecf636d added to master session list  <SEP> in logs no error <SEP> @kadir8446_twitter It is difficult to read use ```start``` <SEP> getting error in test script  \"sendKeyEvent\" is not function <SEP> ```  <SEP> where to user start? <SEP> Can't see any error in logs @kadir8446_twitter <SEP> yes no errors <SEP> Then you might be using incorrect api <SEP> error in test srcipt <SEP> check the latest version and use correct api. <SEP> appium version? <SEP> is it java? <SEP> @sitansu_kar007_twitter When you start appium, pass it as parameter <SEP> using nodejs <SEP> which npm? <SEP> @kadir8446_twitter Which appium java client you are using? <SEP> @Asimk21 Trying by updating the web-kit", "our": "error in test script \"sendKeyEvent\" is not function\n", "gd": "how to add new androidUiautomator2Driver session to master session list?\n"}, {"body": " <SEP>   @BSNayal you can integrate applitools eyes with your tests for comparing screen captures. Here's the website: applitools.com <SEP> Anyone have the idea about the desired capabilities for Android in Saucelab? <SEP> Without any version it always picks latest one", "our": "how to integrate applitools eyes with your tests for comparing screen captures?\n", "gd": "is there a idea about the desired capabilities for Android in Saucelab?\n"}, {"body": " <SEP> Hi all, my Appium Inspector isnt launched, anyone knows what happened here? <SEP> The new session window is in a status of loading page. <SEP> ! <SEP> Trying to test on iOS . <SEP> Can you check logs? You might see some errors. <SEP> The log keeps printing something and no error shows. <SEP> And the app cannot be launched in the simulator as well. <SEP> Weird .. <SEP> There should be some error ... <SEP> Should it be shown after hitting Start Session here? <SEP> In above screenshot. <SEP> It worked when I connected with real device. <SEP> Hi, is it possible to use USB tethering when appium server connected through WIFI (adb device)? <SEP> I'm not sure, I'll check it out thanks @doniyor2109 <SEP> @VIGNESH08097223_twitter I'm trying to do a move and hold the element at the end of the move, like this: touchAction.longPress (FirstElement, Duration.ofSeconds (3)). moveTo (TwoElement.getCenter () .x, TwoElement.getCenter (). y) .waitAction (Duration.ofSeconds (5) ). release (). perform (); but action is not performed <SEP> What context are you in? @umkawz <SEP> @umkawz which element you wish to hold and what action is not performed ? <SEP> I'm updated to appium desktop 1.6.2 (it must be appium 1.8.1). I'm use python Appium-Python-Client==0.26. Have anyone an idea why I haven't relative coordinates in move_to (TouchAction)? <SEP> which are the stable versions of appium and java client ? <SEP> @jlmuralidhar , I think there is 1.8.1 version of appium <SEP> how to downgrade appium version from terminal ? <SEP> Could not start REST http interface listener. The requested port may already be in use. Please make sure there is no other instance of this server running already. uncaughtException: listen EADDRINUSE 0.0.0.0:4723 <SEP> Does anyone here use appium for android automation? I want to deploy it for production, preferably on a VPS or something that automatically invokes the jobs, etc. <SEP> What is the recommended way? Or how are you carrying it out... <SEP> Does anyone know a built in android tool to get framerate like `MediaTrackSettings.frameRate` for web??", "our": "Appium Inspector isnt launched\n", "gd": "appium inspector is not launched on iOS\n"}, {"body": " <SEP> Hi <SEP> I still have troubles finding the webview of a hybrid app in iOS <SEP> I have ios_webkit_debug_proxy running <SEP> but still get An unknown server-side error occurred while processing the command. <SEP> someone knows if there are some way to avoid step install ipa, when I execute test ? <SEP> i think u can remove app capability <SEP> and just provide application startup activity <SEP> i had tried with existing hangout applicaiton where, i do not want to install applicaiton again <SEP> i tried <SEP> thanks <SEP> anyone have an idea how to fix the webview issue i'm having? <SEP> thanks  @priyankshah217 it goes <SEP> Hi, I need some help with run appium project (java client) through maven.. anybody? <SEP> u can refer my repo : https://github.com/priyankshah217 <SEP> Hi guys, I'm new to appium and am running into crashing issues when trying to run basic mobile web app testing. info:  <SEP> @priyankshah217  it's not what I'm looking for.. i have the java client as a submodule.. i want to package the java client and than run \"mvn clean test\".. is it possible?", "our": "how to avoid step install ipa when running test with ios_\n", "gd": "ios webview - unknown server-side error occurred while processing the command\n"}, {"body": " <SEP> Here's another article: http://webdriver.io/guide/services/appium.html <SEP> This is what you need to setup correctly : ```{   ... // Other config    services:  <SEP> thanks, let me try <SEP> I'm afraid that's all I can help with since you are using webdriver.io <SEP> There's not a lot of information if it works with Appium 1.9.0 <SEP> no problem. thanks for the link, I will read up and explore further <SEP> If all else fails, you can still just use appium and write the tests in Javascript", "our": "how to setup appium correctly with webdriver.io\n", "gd": "how to use webdriver with appium 1.9.0.\n"}, {"body": " <SEP> ? <SEP> I am automating test cases for a mobile application built with react. I am using Appium framework, and the client I am using is Webdriver.io, along with Mocha and Chai for assertions.  So far my scripts are running well, but I am facing a problem with scrolling. I have looked at Webdriver.io documentation for scrolling and have implemented touchAction(), touchPerform(), execute(), scrollTo() but no methods are working in this case. Can anyone help me with this?  This is the sample code I am using  ``` var webdriverio = require(\"webdriverio\"); var expect = require(\"chai\").expect; var config = require(\"./helpers/desiredCapabilities\").options; var client = webdriverio.remote(config);  describe(\"Sample Test\", function() {   beforeEach(function() {   this.timeout(90000); });  describe(\"Scroll Test\", function() {   before(function() {     return client.init();   });    it(\"should scroll successfully\", function() {     return client       .element(\"~mobile\")       .setValue(\"1000000000\")       .element(\"~continue\")       .click()       .element(\"~passwordTextField\")       .setValue(\"12345\")       .element(\"~continue\")       .click()       .element(\"~home\")       .touchPerform( <SEP> @zamanarif004_twitter  use browser.touchAction('id',  <SEP> for x and y use your own co-ordinates.", "our": "scrolling problem in react test cases\n", "gd": "scrolling is not working with webdriver.io and webdriver.remot\n"}, {"body": " <SEP>   <SEP> Is it possible to capture the element from above code using label or name using appium in iPhone ? <SEP> @Rahul-Chulliparambil yes. But you using XCUITestDriver ? Whats your Xcode / iOS? <SEP> Hello, Is it possible to control bluetooth setting(ON/OFF) on real Android device using  Appium Java code? <SEP> can it be using  also adb commands? If yes then check https://mmbs.github.io/tools/adb/2016/06/22/helpful-adb-commands/ <SEP> @MaddySinghMaddy just use locators to control blue tooth UI <SEP> Thanks @mgmanikandan87! <SEP> can any one help me out in this please <SEP> how to run appium after setting the desire capablities in appium gui <SEP> i getting issue in intialising the driver <SEP> guys please help me out in this <SEP> @Gamaiva Why not just use Appium CLI? <SEP> @siggerzz  i am currently getting 65 code error <SEP> Testing against iOS? <SEP> Initial tion in driver", "our": "is it possible to control bluetooth setting(ON/OFF) on real Android device using App\n", "gd": "how to control bluetooth ( ON/OFF ) using appium in real android device?\n"}, {"body": " <SEP> Hey guys, when i was running my TestNG script from terminal, i am facing configuration error. It works fine when i run the same script in eclipse. Can anyone help me out. Thanks in advance. <SEP> @areenadira Can't tell you exactly about android but in ios case appiums entrance level is application under test, that means that system wide apps is unaccessible to appium <SEP> @areenadira , In android Gallery app does not allow you to instrument using UIAutomator. so appium can locate elements under it.", "our": "when running my TestNG script from terminal, i am facing configuration error\n", "gd": "i am facing configuration error when i am running my testNG script from terminal in eclipse\n"}, {"body": " <SEP> https://mobileautotools.wordpress.com/appium-setup-for-ios-10/ <SEP> @sudhagetsin_twitter  you cant automate without debug and singed certificate <SEP> You can tweak in WebDriverAgent project to accept signing certificates.", "our": "how to set up a webdriver agent project for ios 10?\n", "gd": "cant automate without debugging and singed certificate\n"}, {"body": " <SEP> Hi can anyone tell me how to switch from native view to embedded web view using Node JS? <SEP> ```  @wd.switch_to.window(\"WEBVIEW_0\")  @wd.switch_to.window(\"NATIVE_APP) ``` <SEP> check your webdriver `wd.window_handles` and make sure you get an array <SEP> http://elementalselenium.com/tips/4-work-with-multiple-windows <SEP> cool , thank you @rstormsf <SEP> np <SEP> @rstormsf , could you please give me the link to the switch_to method? I looked at the wd librairy but cannot find it... I'm afraid I look at the wrong place <SEP> thank you!!! <SEP> https://code.google.com/p/selenium/wiki/JsonWireProtocol#/session/:sessionId/window_handles <SEP> thanks <SEP> Rule#1 Check JSON wire protocol Rule#2 Check your bindings if its implemented (JS, Ruby, Python, Java)  if you cant find see how its done in dif language and what is the method name (maybe the documentation is not up to date, but the method exists) <SEP> https://code.google.com/p/selenium/wiki/WebDriverJs#Understanding_the_API <SEP> https://appium.github.io/java-client/io/appium/java_client/AppiumDriver.html <SEP> Got it, thanks a lot!! really appreciate it <SEP> yeah, I actually know how to do it in Python, just when switched to Node JS.. I got no clue <SEP> but thank you for the hints", "our": "how to switch from native view to embedded web view using node js\n", "gd": "how to switch from native view to embedded web view using node js?\n"}, {"body": " <SEP> what should i do to make appium-adb workable (tests on java)? <SEP> does anybody know? <SEP> what does that mean? <SEP> you want to send adb commands through appium? <SEP> yep <SEP> and use that https://github.com/appium/appium-adb <SEP> Im using this <SEP> try {     Runtime.getRuntime().exec(\"adb shell am start -n io.appium.settings/.Settings -e wifi off\");    } catch (IOException e) {     e.printStackTrace();    } <SEP> for turning the wifi on and off <SEP> and what about appium-adb commands? i installed appium-adb (npm install appium-adb) and don't know, what i should do next.", "our": "what should i do to make appium-adb workable (tests\n", "gd": "how to use appium-adb workable (tests on java)\n"}]